class MatBalance:
    def __init__(self, data):
        self.data_in = {
            "Требуемое содержание меди в штейне": "",
            "Задаем извлечение меди в штейн": "",
            "Плавку ведем на шлак состава": {
                "SiO2": "",
                "CaO": ""
            },
            "Состав кв. флюса": {
                "SiO2": "",
                "Прочие": "",
                "Влажность": ""
            },
            "Состав изв. флюса": {
                "SiO2": "",
                "Прочие": "",
                "Влажность": ""
            },
            "Выход Pb": {
                "В газ": "",
                "В штейн": "",
                "В шлак": ""
            },
            "Выход Zn": {
                "В газ": "",
                "В штейн": "",
                "В шлак": ""
            },
            "Задаем содержание прочих в штейне": "",
            "Кол-во конвер. шлака на 100 кг сух.к-та": "",
        }
        self.Cu_out = data["Содержание меди в штейне(%)"]
        self.e = data["Извлечение Cu в штейн(%)"]
        self.slag = {
            "SiO2": data["Состав шлака из печи"]["SiO2"],
            "CaO": data["Состав шлака из печи"]["CaO"]
        }
        self.quartz = {
            "SiO2": 0,
            "Прочие": 0,
            "Влажность": 0
        }
        self.limestone = {
            "CaO": 0,
            "CO2": 0,
            "Прочие": 0,
            "Влажность": 0
        }